slides/week6/week6.org
#+TITLE: Week 6
#+AUTHOR: Matthew Woodward
#+EMAIL: mwoodward@gatech.edu

* What are we doing today?
- Const Keyword
- Initializer Lists
- Header Guards
- More STL
 - Functors
 - Lambdas
 - Predicates

* Const Keyword
- Can be used on both variables and member functions of objects
 - Const Variable
  - Makes the value /constant/ as the name implies
  - Must be initialized when declared
  - This can also be applied to the arguments and return type of a function
 - Const Member Function
  - Makes the member function read-only
  - It can only read and return values, it cannot change any of the members of the class

** Constant Variables
#+BEGIN_SRC c++
int main() {
    const int x; // This causes an error

    const int x = 0; // This is correct

    return 0;
}
#+END_SRC
[[https://ideone.com/4D2EoC][Example]]

** Constant Arguments
#+BEGIN_SRC c++
int constantArguments(const int x) {
    std::cout << x << std::endl; // This is fine
    x = 5; // This causes an error

    return x;
}
#+END_SRC

** Constant Member Functions
#+BEGIN_SRC c++
class Example {
public:
    int x;
    int GetX() const; //GetX is a constant member function
};
#+END_SRC
[[https://ideone.com/I854Gu][Example]]

** Why is this useful?
- Good coding practice
 - Makes it clear what should and should not change
 - Prevents others from accidentally changing something
- More Efficient
 - The compiler can optimize aggresively around constant variables since they don't change


* Initializer Lists
#+BEGIN_NOTES
Describe what the below code does. Want to give a basic understanding of what it does
before trying to explain why they are useful
#+END_NOTES

#+BEGIN_SRC c++
class Example {
public:
    int x;
    ClassA obj1;
    ClassB obj2;

    Example(int xValue, int arg1, int arg2) : x(xValue), obj1(arg2), obj2(arg1, arg2) {
#+END_SRC


** Benefits of Initializer Lists
- Initializes the member variables before the object is constructed
 - This allows you to have your member objects initialized before your constructor runs
 - It also allows you to have const member variables since they would otherwise error when you try to declare them without a value

** Initiliazing Constant Member Variables
#+BEGIN_SRC c++
class Example {
public:
    const int x;
    Example() {
        x = 5; //This causes an error since you can't "change" the value of a const
    }
}
#+End_SRC
- You can't set the value of a constant variable after it has been declared

#+BEGIN_NOTES
Someone check me on that second statement
#+END_NOTES

** Initiliazing Constant Member Variables pt. 2
#+BEGIN_SRC c++
class Example {
public:
    const int x;
    Example() : x(5);
}
#+End_SRC
- This works because the initialization chain intializes the constant variable before the object is constructed so it runs before the value of the const is frozen
- This is also preferred over initializing the constant in the declaration of the class (~const int x = 5~)
** Default Constructors with Custom Default Values
- When a default constructor runs it calls the default constructors of all of the member variables
- But sometimes you want your class to have different default values than the standard default constructors of its members

** The Inefficient way to set default values
#+BEGIN_SRC c++
class Example {
public:
    int x;
    ClassA object1;
    Example() {
        x = 5;
        object1.field1 = 1;
        object1.field2 = 2;
    }
}
#+END_SRC
- This is inefficient because the default constructors of the objects are called first
 - This doesn't really matter for a primitive data type like an int but it could have a larger impact when called for more complex classes

** The Efficient way to set default values
#+BEGIN_SRC c++
class Example {
    int x;
    ClassA object1;
    Example() : x(5), object1(1,2){}
}
#+END_SRC
- This is more efficient because the member variables' constructors are called first so the default constructors are not also called
 - This does assume that object1 has a constructor to set field1 and field 2 though

* Header Guards

#+BEGIN_NOTES
Go to the next slide to illustrate the issue
#+END_NOTES

#+BEGIN_SRC c++
//in file: "example.cpp"
class Example {
    int x;
}
#+END_SRC

#+BEGIN_SRC c++
//in file: "b.cpp"
#include "example.cpp"
class B {
    Example y;
}
#+END_SRC

#+BEGIN_SRC c++
//in file: "main.cpp"
#include "example.cpp"
#include "b.cpp"

int main() {
    Example obj1;
    B obj2;

    return 0;
}
#+END_SRC

- Question: Why does this code cause an error?

