slides/week6/week6.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Week 6</title>
<meta name="author" content="(Matthew Woodward)"/>
<link rel="stylesheet" href="https://robojackets.github.io/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="https://robojackets.github.io/reveal.js/css/theme/white.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Week 6</h1>
</section>

<section id="slide-orgabdc71a">
<h2 id="orgabdc71a">What are we doing today?</h2>
<ul>
<li>Const Keyword</li>
<li>Initializer Lists</li>
<li>Header Guards</li>
<li>More STL
<ul>
<li>Functors</li>
<li>Lambdas</li>
<li>Predicates</li>

</ul></li>

</ul>

</section>
<section id="slide-org209e5f2">
<h2 id="org209e5f2">Const Keyword</h2>
<ul>
<li>Can be used on both variables and member functions of objects
<ul>
<li>Const Variable
<ul>
<li>Makes the value <i>constant</i> as the name implies</li>
<li>Must be initialized when declared</li>
<li>This can also be applied to the arguments and return type of a function</li>

</ul></li>
<li>Const Member Function
<ul>
<li>Makes the member function read-only</li>
<li>It can only read and return values, it cannot change any of the members of the class</li>

</ul></li>

</ul></li>

</ul>

</section>
<section id="slide-org20a2235">
<h3 id="org20a2235">Constant Variables</h3>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #598249;">int</span> <span style="color: #2F7BDE;">main</span>() {
    <span style="color: #598249;">const</span> <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>; <span style="color: #5e6263;">// </span><span style="color: #5e6263;">This causes an error</span>

    <span style="color: #598249;">const</span> <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span> = 0; <span style="color: #5e6263;">// </span><span style="color: #5e6263;">This is correct</span>

    <span style="color: #598249;">return</span> 0;
}
</code></pre>
</div>
<p>
<a href="https://ideone.com/4D2EoC">Example</a>
</p>

</section>
<section id="slide-org400c9bf">
<h3 id="org400c9bf">Constant Arguments</h3>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #598249;">int</span> <span style="color: #2F7BDE;">constantArguments</span>(<span style="color: #598249;">const</span> <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>) {
    <span style="color: #15968D;">std</span>::cout &lt;&lt; x &lt;&lt; <span style="color: #15968D;">std</span>::endl; <span style="color: #5e6263;">// </span><span style="color: #5e6263;">This is fine</span>
    x = 5; <span style="color: #5e6263;">// </span><span style="color: #5e6263;">This causes an error</span>

    <span style="color: #598249;">return</span> x;
}
</code></pre>
</div>

</section>
<section id="slide-org7405df6">
<h3 id="org7405df6">Constant Member Functions</h3>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #598249;">class</span> <span style="color: #598249;">Example</span> {
<span style="color: #598249;">public</span>:
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>;
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">GetX</span>() <span style="color: #598249;">const</span>; <span style="color: #5e6263;">//</span><span style="color: #5e6263;">GetX is a constant member function</span>
};
</code></pre>
</div>
<p>
<a href="https://ideone.com/I854Gu">Example</a>
</p>

</section>
<section id="slide-org03bd69c">
<h3 id="org03bd69c">Why is this useful?</h3>
<ul>
<li>Good coding practice
<ul>
<li>Makes it clear what should and should not change</li>
<li>Prevents others from accidentally changing something</li>

</ul></li>
<li>More Efficient
<ul>
<li>The compiler can optimize aggresively around constant variables since they don't change</li>

</ul></li>

</ul>


</section>
<section id="slide-org7a2a284">
<h2 id="org7a2a284">Initializer Lists</h2>
<aside class="notes">
<p>
Describe what the below code does. Want to give a basic understanding of what it does
before trying to explain why they are useful
</p>

</aside>

<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #598249;">class</span> <span style="color: #598249;">Example</span> {
<span style="color: #598249;">public</span>:
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>;
    <span style="color: #598249;">ClassA</span> <span style="color: #2F7BDE;">obj1</span>;
    <span style="color: #598249;">ClassB</span> <span style="color: #2F7BDE;">obj2</span>;

    <span style="color: #2F7BDE;">Example</span>(<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">xValue</span>, <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">arg1</span>, <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">arg2</span>) : x(xValue), obj1(arg2), obj2(arg1, arg2) {
</code></pre>
</div>


</section>
<section id="slide-org6bd3d21">
<h3 id="org6bd3d21">Benefits of Initializer Lists</h3>
<ul>
<li>Initializes the member variables before the object is constructed
<ul>
<li>This allows you to have your member objects initialized before your constructor runs</li>
<li>It also allows you to have const member variables since they would otherwise error when you try to declare them without a value</li>

</ul></li>

</ul>

</section>
<section id="slide-org82337d3">
<h3 id="org82337d3">Initiliazing Constant Member Variables</h3>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #598249;">class</span> <span style="color: #598249;">Example</span> {
<span style="color: #598249;">public</span>:
    <span style="color: #598249;">const</span> <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>;
    <span style="color: #2F7BDE;">Example</span>() {
        x = 5; <span style="color: #5e6263;">//</span><span style="color: #5e6263;">This causes an error since you can't "change" the value of a const</span>
    }
}
</code></pre>
</div>
<ul>
<li>You can't set the value of a constant variable after it has been declared</li>

</ul>

<aside class="notes">
<p>
Someone check me on that second statement
</p>

</aside>

</section>
<section id="slide-orgd7b2d84">
<h3 id="orgd7b2d84">Initiliazing Constant Member Variables pt. 2</h3>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #598249;">class</span> <span style="color: #598249;">Example</span> {
<span style="color: #598249;">public</span>:
    <span style="color: #598249;">const</span> <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>;
    <span style="color: #2F7BDE;">Example</span>() : x(5);
}
</code></pre>
</div>
<ul>
<li>This works because the initialization chain intializes the constant variable before the object is constructed so it runs before the value of the const is frozen</li>
<li>This is also preferred over initializing the constant in the declaration of the class (<code>const int x = 5</code>)</li>

</ul>
</section>
<section id="slide-org3336922">
<h3 id="org3336922">Default Constructors with Custom Default Values</h3>
<ul>
<li>When a default constructor runs it calls the default constructors of all of the member variables</li>
<li>But sometimes you want your class to have different default values than the standard default constructors of its members</li>

</ul>

</section>
<section id="slide-orgf35e275">
<h3 id="orgf35e275">The Inefficient way to set default values</h3>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #598249;">class</span> <span style="color: #598249;">Example</span> {
<span style="color: #598249;">public</span>:
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>;
    <span style="color: #598249;">ClassA</span> <span style="color: #2F7BDE;">object1</span>;
    <span style="color: #2F7BDE;">Example</span>() {
        x = 5;
        object1.field1 = 1;
        object1.field2 = 2;
    }
}
</code></pre>
</div>
<ul>
<li>This is inefficient because the default constructors of the objects are called first
<ul>
<li>This doesn't really matter for a primitive data type like an int but it could have a larger impact when called for more complex classes</li>

</ul></li>

</ul>

</section>
<section id="slide-org5135f0a">
<h3 id="org5135f0a">The Efficient way to set default values</h3>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #598249;">class</span> <span style="color: #598249;">Example</span> {
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>;
    <span style="color: #598249;">ClassA</span> <span style="color: #2F7BDE;">object1</span>;
    <span style="color: #2F7BDE;">Example</span>() : x(5), object1(1,2){}
}
</code></pre>
</div>
<ul>
<li>This is more efficient because the member variables' constructors are called first so the default constructors are not also called
<ul>
<li>This does assume that object1 has a constructor to set field1 and field 2 though</li>

</ul></li>

</ul>

</section>
<section id="slide-org13ae960">
<h2 id="org13ae960">Header Guards</h2>
<aside class="notes">
<p>
Go to the next slide to illustrate the issue
</p>

</aside>

<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #5e6263;">//</span><span style="color: #5e6263;">in file: "example.cpp"</span>
<span style="color: #598249;">class</span> <span style="color: #598249;">Example</span> {
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>;
}
</code></pre>
</div>

<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #5e6263;">//</span><span style="color: #5e6263;">in file: "b.cpp"</span>
<span style="color: #598249;">#include</span> <span style="color: #15968D;">"example.cpp"</span>
<span style="color: #598249;">class</span> <span style="color: #598249;">B</span> {
    <span style="color: #598249;">Example</span> <span style="color: #2F7BDE;">y</span>;
}
</code></pre>
</div>

<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #5e6263;">//</span><span style="color: #5e6263;">in file: "main.cpp"</span>
<span style="color: #598249;">#include</span> <span style="color: #15968D;">"example.cpp"</span>
<span style="color: #598249;">#include</span> <span style="color: #15968D;">"b.cpp"</span>

<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">main</span>() {
    <span style="color: #598249;">Example</span> <span style="color: #2F7BDE;">obj1</span>;
    <span style="color: #598249;">B</span> <span style="color: #2F7BDE;">obj2</span>;

    <span style="color: #598249;">return</span> 0;
}
</code></pre>
</div>

<ul>
<li>Question: Why does this code cause an error?</li>

</ul>

</section>
