slides/week6/week6.org
** Header Guards pt. 2

#+BEGIN_NOTES
Include statments aren't "run"... anybody have a better term for this?
#+END_NOTES

#+BEGIN_SRC c++
//in file: "main.cpp" after include statments are run

class Example {
    int x;
}

class Example {
    int x;
}

class B {
    Example y;
}

int main() {
    Example obj1;
    B obj2;

    return 0;
}
#+END_SRC


** Header Guards pt. 3
- Example is defined twice and the compiler doesn't know which one to use
- Header guards prevent header files (the .h files that we use to declare classes) from conflicting with themselves by only including the code once

** Header Guard Syntax

#+BEGIN_SRC c++
//in file: "example.h"
#ifndef EXAMPLE_H
#define EXAMPLE_H
class Example {
    int x;
}
#endif
#+END_SRC

- ~#~   indicates a Preprocessor Directive. These alter the source code as it is passed into the compiler
 - ~#include~   copies the code from the indicated source and pastes it where the include was called
 - ~#ifndef~    checks if the given macro is not defined
 - ~#define~    defines the given macro
 - ~#endif~     closes the if statement started by #ifndef

** Header Guard Syntax pt. 2
- Header guards work by only allowing the compiler to see the code inside the ifndef if the given macro is not yet defined.
    After the compiler has processed the .h file once the ~EXAMPLE_H~ macro is defined so the next time it attempts to include the file the code is hidden inside the if statement
- Almost every compiler also supports the command  ~#pragma once~ which does the same thing as the header guard although it is not technically part of the C++ standard


* Functors
- A functor is basically an object with the operator() which allows it to be called like a function
- This allows us to create a "function" that can store data or use more information than its input arguments would otherwise allow
** Functor Example
#+BEGIN_SRC c++
class increment {
public:
    int num;
    increment(int n) : num(n){}

    // This allows the functor to be called using () like a function
    int operator () (int numIn) const {
        return numIn + num;
    }
};

int main() {
    increment exampleFunctor(2);
    int x = 5;
    std::cout << exampleFunctor(5) << std::endl // Outputs 7
    return 0;
}
#+END_SRC

** Lambdas
- A lambda expression basically writes a short inline function
- Syntax:
#+BEGIN_SRC
[capture clause] (arguments) -> return-type
{
    Definition of method
}
#+END_SRC
** Syntax Breakdown
- Most of the syntax works as it does in a function
- Arguments: the list of input arguments (ex: int a, double b,...)
- Return-type: The type that the function returns (ex: bool)
 - Usually the arrow and return-type can be ommited since the compiler can figure it out
#+BEGIN_SRC
[capture clause] (arguments) -> return-type
{
    Definition of method
}
#+END_SRC
** Capture Clauses
- It is important to note that although the lambda is defined inline the code still accesses it through a normal function call
 - This means that variables that were in the local scope before the lambda call are /not/ in this scope
- In order to access these variables we have to tell the compiler how we want to access them
| Access Type          | Capture Clause |
|----------------------+----------------|
| By Reference         | [&]            |
|----------------------+----------------|
| By Value             | [=]            |
|----------------------+----------------|
| Individually specify | [varA, &varB]  |
** Lambda Example
#+BEGIN_SRC c++
#include <iostream>

using namespace std;

void print_sum(int x1, int x2) {
  cout << x1 << " + " << x2 << " = " << x1 + x2 << endl;
}

int main() {
  int calculated_value = 10;

  auto print_plus_calculated_val = [&calculated_value](int x) {
    print_sum(calculated_value, x);
  };

  for (int i = 0; i < 5; i++) {
    print_plus_calculated_val(i);
  }
}
#+END_SRC
[[https://ideone.com/i5U6hC][Example]]
** STL and Functors
- Many STL algorithms accept functors and lambdas as their last argument
- Types of Functors:
 - Generator: a Functor that takes no arguments
 - Unary Function: a Functor that can be called with one argument
 - Binary Function: a Functor that can be called with two arguments
** Predicates
- A Predicate is a function or functor that returns a boolean value
- A common use for predicates is to allow an STL algorithm to be applied only to the members of a container that meet the requirement of the Predicate
** =count_if=
- =count_if= is a STL function that counts the number of elements in a container that match the condition of the unary predicate it is given
- =count_if(InputIterator first, InputIterator last, UnaryPredicate pred)=

