slides/week6/week6.html
<section id="slide-org723acea">
<h3 id="org723acea">Header Guards pt. 2</h3>
<aside class="notes">
<p>
Include statments aren't "run"&#x2026; anybody have a better term for this?
</p>

</aside>

<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #5e6263;">//</span><span style="color: #5e6263;">in file: "main.cpp" after include statments are run</span>

<span style="color: #598249;">class</span> <span style="color: #598249;">Example</span> {
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>;
}

<span style="color: #598249;">class</span> <span style="color: #598249;">Example</span> {
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>;
}

<span style="color: #598249;">class</span> <span style="color: #598249;">B</span> {
    <span style="color: #598249;">Example</span> <span style="color: #2F7BDE;">y</span>;
}

<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">main</span>() {
    <span style="color: #598249;">Example</span> <span style="color: #2F7BDE;">obj1</span>;
    <span style="color: #598249;">B</span> <span style="color: #2F7BDE;">obj2</span>;

    <span style="color: #598249;">return</span> 0;
}
</code></pre>
</div>


</section>
<section id="slide-org34564c6">
<h3 id="org34564c6">Header Guards pt. 3</h3>
<ul>
<li>Example is defined twice and the compiler doesn't know which one to use</li>
<li>Header guards prevent header files (the .h files that we use to declare classes) from conflicting with themselves by only including the code once</li>

</ul>

</section>
<section id="slide-org5ae8d34">
<h3 id="org5ae8d34">Header Guard Syntax</h3>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #5e6263;">//</span><span style="color: #5e6263;">in file: "example.h"</span>
<span style="color: #598249;">#if</span><span style="color: #598249;">n</span><span style="color: #598249;">def</span> EXAMPLE_H
<span style="color: #598249;">#define</span> <span style="color: #2F7BDE;">EXAMPLE_H</span>
<span style="color: #598249;">class</span> <span style="color: #598249;">Example</span> {
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>;
}
<span style="color: #598249;">#endif</span>
</code></pre>
</div>

<ul>
<li><code>#</code>   indicates a Preprocessor Directive. These alter the source code as it is passed into the compiler
<ul>
<li><code>#include</code>   copies the code from the indicated source and pastes it where the include was called</li>
<li><code>#ifndef</code>    checks if the given macro is not defined</li>
<li><code>#define</code>    defines the given macro</li>
<li><code>#endif</code>     closes the if statement started by #ifndef</li>

</ul></li>

</ul>

</section>
<section id="slide-orga2f81b8">
<h3 id="orga2f81b8">Header Guard Syntax pt. 2</h3>
<ul>
<li>Header guards work by only allowing the compiler to see the code inside the ifndef if the given macro is not yet defined.
After the compiler has processed the .h file once the <code>EXAMPLE_H</code> macro is defined so the next time it attempts to include the file the code is hidden inside the if statement</li>
<li>Almost every compiler also supports the command  <code>#pragma once</code> which does the same thing as the header guard although it is not technically part of the C++ standard</li>

</ul>


</section>
<section id="slide-orgebd7eae">
<h2 id="orgebd7eae">Functors</h2>
<ul>
<li>A functor is basically an object with the operator() which allows it to be called like a function</li>
<li>This allows us to create a "function" that can store data or use more information than its input arguments would otherwise allow</li>

</ul>
</section>
<section id="slide-org9ca4c2e">
<h3 id="org9ca4c2e">Functor Example</h3>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #598249;">class</span> <span style="color: #598249;">increment</span> {
<span style="color: #598249;">public</span>:
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">num</span>;
    <span style="color: #2F7BDE;">increment</span>(<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">n</span>) : num(n){}

    <span style="color: #5e6263;">// </span><span style="color: #5e6263;">This allows the functor to be called using () like a function</span>
    <span style="color: #598249;">int</span> <span style="color: #598249;">operator</span> <span style="color: #2F7BDE;">()</span> (<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">numIn</span>) <span style="color: #598249;">const</span> {
        <span style="color: #598249;">return</span> numIn + num;
    }
};

<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">main</span>() {
    <span style="color: #598249;">increment</span> <span style="color: #2F7BDE;">exampleFunctor</span>(2);
    <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span> = 5;
    <span style="color: #15968D;">std</span>::cout &lt;&lt; exampleFunctor(5) &lt;&lt; <span style="color: #15968D;">std</span>::endl <span style="color: #5e6263;">// </span><span style="color: #5e6263;">Outputs 7</span>
    <span style="color: #598249;">return</span> 0;
}
</code></pre>
</div>

</section>
<section id="slide-org9c78e6b">
<h3 id="org9c78e6b">Lambdas</h3>
<ul>
<li>A lambda expression basically writes a short inline function</li>
<li>Syntax:</li>

</ul>
<pre  class="example">
[capture clause] (arguments) -&gt; return-type
{
    Definition of method
}
</pre>
</section>
<section id="slide-org5a8f8b6">
<h3 id="org5a8f8b6">Syntax Breakdown</h3>
<ul>
<li>Most of the syntax works as it does in a function</li>
<li>Arguments: the list of input arguments (ex: int a, double b,&#x2026;)</li>
<li>Return-type: The type that the function returns (ex: bool)
<ul>
<li>Usually the arrow and return-type can be ommited since the compiler can figure it out</li>

</ul></li>

</ul>
<pre  class="example">
[capture clause] (arguments) -&gt; return-type
{
    Definition of method
}
</pre>
</section>
<section id="slide-org9bbf79d">
<h3 id="org9bbf79d">Capture Clauses</h3>
<ul>
<li>It is important to note that although the lambda is defined inline the code still accesses it through a normal function call
<ul>
<li>This means that variables that were in the local scope before the lambda call are <i>not</i> in this scope</li>

</ul></li>
<li>In order to access these variables we have to tell the compiler how we want to access them</li>

</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Access Type</th>
<th scope="col" class="org-left">Capture Clause</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">By Reference</td>
<td class="org-left">[&amp;]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">By Value</td>
<td class="org-left">[=]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Individually specify</td>
<td class="org-left">[varA, &amp;varB]</td>
</tr>
</tbody>
</table>
</section>
<section id="slide-orgee151e0">
<h3 id="orgee151e0">Lambda Example</h3>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #598249;">#include</span> <span style="color: #15968D;">&lt;iostream&gt;</span>

<span style="color: #598249;">using</span> <span style="color: #598249;">namespace</span> <span style="color: #15968D;">std</span>;

<span style="color: #598249;">void</span> <span style="color: #2F7BDE;">print_sum</span>(<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x1</span>, <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x2</span>) {
  cout &lt;&lt; x1 &lt;&lt; <span style="color: #15968D;">" + "</span> &lt;&lt; x2 &lt;&lt; <span style="color: #15968D;">" = "</span> &lt;&lt; x1 + x2 &lt;&lt; endl;
}

<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">main</span>() {
  <span style="color: #598249;">int</span> <span style="color: #2F7BDE;">calculated_value</span> = 10;

  <span style="color: #598249;">auto</span> <span style="color: #2F7BDE;">print_plus_calculated_val</span> = [&amp;<span style="color: #2F7BDE;">calculated_value</span>](<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">x</span>) {
    print_sum(calculated_value, x);
  };

  <span style="color: #598249;">for</span> (<span style="color: #598249;">int</span> <span style="color: #2F7BDE;">i</span> = 0; i &lt; 5; i++) {
    print_plus_calculated_val(i);
  }
}
</code></pre>
</div>
<p>
<a href="https://ideone.com/i5U6hC">Example</a>
</p>
</section>
<section id="slide-orgf49db5b">
<h3 id="orgf49db5b">STL and Functors</h3>
<ul>
<li>Many STL algorithms accept functors and lambdas as their last argument</li>
<li>Types of Functors:
<ul>
<li>Generator: a Functor that takes no arguments</li>
<li>Unary Function: a Functor that can be called with one argument</li>
<li>Binary Function: a Functor that can be called with two arguments</li>

</ul></li>

</ul>
</section>
<section id="slide-orgac65823">
<h3 id="orgac65823">Predicates</h3>
<ul>
<li>A Predicate is a function or functor that returns a boolean value</li>
<li>A common use for predicates is to allow an STL algorithm to be applied only to the members of a container that meet the requirement of the Predicate</li>

</ul>
</section>
<section id="slide-org1cbf1d8">
<h3 id="org1cbf1d8"><code>count_if</code></h3>
<ul>
<li><code>count_if</code> is a STL function that counts the number of elements in a container that match the condition of the unary predicate it is given</li>
<li><code>count_if(InputIterator first, InputIterator last, UnaryPredicate pred)</code></li>

</ul>

</section>
